import axios from 'axios'
import { Message } from 'element-ui'
// import NProgress from 'nprogress'
import 'nprogress/nprogress.css'
// const router = require('~router')

const errors = {
  400000: '权限组名称存在非法字符',
  400001: '权限组已存在',
  400002: '权限组ID仅为数字',
  400003: '权限组不存在',
  400004: '权限名称缺失',
  400005: '用户名缺失',
  400006: '用戶名过短',
  400007: '用戶名过长',
  400008: '用戶名存在非法字符',
  400009: '用户名已存在',
  400010: '密码缺失',
  400011: '密码过短',
  400012: '密码过长',
  400013: '密码存在非法字符',
  400014: '用户电话格式错误',
  400015: '用户头像图片url格式错误',
  400016: '用户ip格式错误',
  400017: '用户所属的权限组ID缺失',
  400018: '用户所属的权限组不存在',
  400019: '用户启用状态错误',
  400020: '用户不存在',
  400021: '病种不存在',
  400022: '病种名称存在非法字符',
  400023: '医生名称存在非法字符',
  400024: '医生名称已存在',
  400025: '医生不存在',
  400026: '医生启用状态错误',
  400027: '渠道名称缺失',
  400028: '渠道名称存在非法字符',
  400029: '渠道已存在',
  400030: '渠道不存在',
  400031: '渠道启用状态错误',
  400032: '咨询方式名称存在非法字符',
  400033: '咨询方式已存在',
  400034: '咨询方式不存在',
  400035: '病患名缺失',
  400036: '病患名存在非法字符',
  400037: '病患性别错误',
  400038: '病患性别错误',
  400039: '病患电话格式错误',
  400040: '病患微信号错误',
  400041: '病患状态错误',
  400042: '病患搜索关键词错误',
  400043: '病患访问页面url错误',
  400044: '病患标记错误',
  400045: '病患消费错误',
  400046: '病患首次状态错误',
  400047: '病患预约时间缺失',
  400048: '病患预约时间错误',
  400049: '病患到诊时间错误',
  400050: '病患所属咨询方式缺失',
  400051: '病患所属咨询方式错误',
  400052: '病患所属咨询方式不存在',
  400053: '病患所属渠道缺失',
  400054: '病患所属渠道错误',
  400055: '病患所属渠道不存在',
  400056: '病患所属病种缺失',
  400057: '病患所属病种错误',
  400058: '病患所属病种不存在',
  400059: '病患所属医生缺失',
  400060: '病患所属医生错误',
  400061: '病患所属医生不存在',
  400062: '病患所属经办人不存在',
  400063: '病患所属经办人不存在',
  400064: '病患所属经办人不存在',
  400065: '更改的病患ID错误',
  400066: '更改的病患不存在',
  400067: '统计类型不存在',
  400068: '统计类型错误',
  400069: '日期类型不存在',
  400070: '日期类型错误',
  400071: '起始日期不存在',
  400072: '起始日期错误',
  400073: '截至日期不存在',
  400074: '截至日期错误',
  400075: '截至日期错误',
  401000: '用戶名缺失',
  401001: '密码缺失',
  401002: '用戶名过短',
  401003: '密码过短',
  401004: '用戶名过长',
  401005: '密码过长',
  401006: '用戶名存在非法字符',
  401007: '密码存在非法字符',
  401008: '用戶不存在',
  401009: '密码错误',
  401010: '权限详情参数不存在',
  403001: '无权访问rank show api',
  403002: '无权查看客户登记信息',
  403003: '无权编辑TA人登记信息',
  403004: '无权使用导出EXCEL功能',
  403005: '无权使用数据中心模块',
  403006: '无权查看总体数据',
  403007: '无权查看用户数据',
  403008: '无权查看病种数据',
  403009: '无权查看渠道数据',
  403010: '无权查看医生数据',
  403011: '无权查看客户数据',
  403012: '无权使用信息管理模块',
  403013: '无权新增病种科室',
  403014: '无权删除病种科室',
  403015: '无权修改病种科室',
  403016: '无权新增医生',
  403017: '无权删除医生',
  403018: '无权修改医生',
  403019: '无权新增来源渠道',
  403020: '无权删除来源渠道',
  403021: '无权修改来源渠道',
  403022: '无权新增咨询方式',
  403023: '无权删除咨询方式',
  403024: '无权修改咨询方式',
  403025: '无权使用人员管理模块',
  403026: '无权新增角色组',
  403027: '无权删除角色组',
  403028: '无权修改角色组',
  403029: '无权修改角色组权限',
  403030: '无权新增用户',
  403031: '无权删除用户',
  403032: '无权修改用户',
  403033: '无权允许使用系统管理模块',
  403034: '无权查看日志记录',
  500000: '网络错误',
  500001: '保存失败',
  500002: '无法删除存在子用户的权限组',
  500003: '无法删除存在子病种的病种类'
}

let axiosInstance = axios.create({
  baseURL: 'http://crm.mrdaisite.com/api',
  timeout: 3000,
  headers: {'Content-Type': 'application/x-www-form-urlencoded'}
})

axiosInstance.interceptors.request.use(
  config => {
    if (sessionStorage.token) {
      config.headers.common['Authorization'] = `Bearer ${sessionStorage.token}`
    }
    return config
  },
  err => {
    Message.error({
      message: 'Internal Error'
    })
    return Promise.reject(err)
  })

axiosInstance.interceptors.response.use(
  response => {
    // if (response.headers.authorization) sessionStorage.token = response.headers.authorization.replace(/Bearer\s/,'');
    return response.data
  },
  error => {
    if (error.response) {
      let errorCode = error.response.data.message
      Message.error(errors[errorCode])
    }
    return Promise.reject(error.response.data)
  })

export default axiosInstance
